---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AngularDimensionsEnabled
source: html/8420ed02-5b86-dff2-4cc5-7c6307701762.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AngularDimensionsEnabled Property

Identifies if any angular dimensions will be shown or not.

## Syntax (C#)
```csharp
public bool AngularDimensionsEnabled { get; set; }
```